Revit 2023 API
ViewNode Class
 A render node that represents a view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2014
Syntax
C#
public class ViewNode : RenderNode
Visual Basic
Public Class ViewNode _
	Inherits RenderNode
Visual C++
public ref class ViewNode : public RenderNode
Remarks
 See also: OnViewBegin(ViewNode).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ViewNode
See Also
ViewNode Members
Autodesk.Revit.DB Namespace